In [1]:
import pandas as pd

data = {
    "Employee_ID": [101, 102, 103, 104],
    "Name": ["Amit", "Bhavna", "Chetan", "Divya"],
    "Department": ["HR", "Finance", "IT", "Marketing"],
    "Salary": [50000, 60000, 55000, 52000],
    "Joining_Date": ["2022-01-10", "2021-03-15", "2020-07-01", "2023-02-20"]
}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

   Employee_ID    Name Department  Salary Joining_Date
0          101    Amit         HR   50000   2022-01-10
1          102  Bhavna    Finance   60000   2021-03-15
2          103  Chetan         IT   55000   2020-07-01
3          104   Divya  Marketing   52000   2023-02-20

In [4]:
df.to_parquet('employees.parquet', engine='pyarrow')

In [5]:
df_parquet = pd.read_parquet('employees.parquet')

In [6]:
df_parquet

   Employee_ID    Name Department  Salary Joining_Date
0          101    Amit         HR   50000   2022-01-10
1          102  Bhavna    Finance   60000   2021-03-15
2          103  Chetan         IT   55000   2020-07-01
3          104   Divya  Marketing   52000   2023-02-20

In [7]:
df.to_excel('employees.xlsx', index=False, sheet_name='EmployeeData')

In [8]:
df_excel = pd.read_excel('employees.xlsx', sheet_name='EmployeeData')

In [9]:
df_excel

   Employee_ID    Name Department  Salary Joining_Date
0          101    Amit         HR   50000   2022-01-10
1          102  Bhavna    Finance   60000   2021-03-15
2          103  Chetan         IT   55000   2020-07-01
3          104   Divya  Marketing   52000   2023-02-20

In [10]:
df.to_json('employees.json', orient='records', indent=4)